In [27]:
import pandas as pd
import numpy as np

In [28]:
d = pd.Series([1,2,3],index=['a','b','c'])
print(d)

a    1
b    2
c    3
dtype: int64

In [29]:
data = [['liu','xinyang',24],['zhang','san',25],['li','si',23]]
df = pd.DataFrame(data,columns=['姓','名','年龄'],index=range(1,4))
print(df)

       姓        名  年龄
1    liu  xinyang  24
2  zhang      san  25
3     li       si  23

In [30]:
a=df['名']
print(a)
type(a)

1    xinyang
2        san
3         si
Name: 名, dtype: object

pandas.core.series.Series

In [31]:
df1 = pd.DataFrame(a)
print(df1)
type(df1)

         名
1  xinyang
2      san
3       si

pandas.core.frame.DataFrame

In [32]:
df['全名'] = df['姓'] + df['名']
print(df)

       姓        名  年龄          全名
1    liu  xinyang  24  liuxinyang
2  zhang      san  25    zhangsan
3     li       si  23        lisi

In [33]:
df.index = ['one','two','three']
df.columns = ['last_name','first_name','age','full_name']
print(df)

      last_name first_name  age   full_name
one         liu    xinyang   24  liuxinyang
two       zhang        san   25    zhangsan
three        li         si   23        lisi

In [34]:
df.rename(columns={'last_name':'姓','first_name':'名','age':'年龄','full_name':'全名'},inplace=True)
print(df)

           姓        名  年龄          全名
one      liu  xinyang  24  liuxinyang
two    zhang      san  25    zhangsan
three     li       si  23        lisi

In [35]:
df.drop('年龄', axis=1, inplace=True)
print(df)

           姓        名          全名
one      liu  xinyang  liuxinyang
two    zhang      san    zhangsan
three     li       si        lisi

In [37]:
d = pd.read_excel("https://oss.xinchanjiao.com/upload/default/20220914-1bbc5a0e-9409-4ffa-adab-06f15090e2fb.xlsx",sheet_name=0,converters={'年':str,'月':str,'门店':str})
d.head()

      年    月    门店       销售收入       销售成本       销售毛利
0  2022  Jan  门店01  478803.28  295586.23  183217.05
1  2022  Jan  门店02  442108.16  330633.55  111474.61
2  2022  Jan  门店03  367875.06  190555.04  177320.02
3  2022  Jan  门店04  174356.94  138562.72   35794.22
4  2022  Jan  门店05  182158.68  113867.90   68290.78

In [38]:
d = pd.read_excel("https://oss.xinchanjiao.com/upload/default/20220914-1bbc5a0e-9409-4ffa-adab-06f15090e2fb.xlsx",sheet_name=0,converters={'年':str,'月':str,'门店':str},index_col='门店')
d.head()

         年    月       销售收入       销售成本       销售毛利
门店
门店01  2022  Jan  478803.28  295586.23  183217.05
门店02  2022  Jan  442108.16  330633.55  111474.61
门店03  2022  Jan  367875.06  190555.04  177320.02
门店04  2022  Jan  174356.94  138562.72   35794.22
门店05  2022  Jan  182158.68  113867.90   68290.78